#include <iostream>
#include <cmath>
using namespace std;
int main() {
    setlocale(LC_ALL, "Russian");
    int n; // число, яке вводить користувач
    int c; // змінна обчислення оберненого двійкового коду числа n
    int x = 0; // вираховування кількості цифр у двоїчному коді
    int res = 0; //результат
    cout << "Введiть натуральне число: ";
    cin >> n;
    int p = n; // змінна присвоєння введеного числа
    if (n < 0) {
        cout << "error"; // число має бути натуральним
    }
    else {
        while (p > 1) {
            x=x+1;            // вираховування кількості цифр в двійковому коді
            p /= 2;
        }
        while (n > 0) {
                c = n % 2;     //  обчислення оберненого двійкового коду числа n
                n /=  2;
                res += c * pow(2, x); // перевід у десяткову СЧ
                x=x-1;
        }
        
        cout << res;
    }

    return 0;
}

